## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 14 to add, 35 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_policy.api will be updated in-place
  ~ resource "aws_iam_policy" "api" {
        id        = "arn:aws:iam::806545929748:policy/scan-files-api"
        name      = "scan-files-api"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "logs:PutLogEvents",
                            "logs:CreateLogStream",
                            "logs:CreateLogGroup",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:logs:ca-central-1:806545929748:log-group:*"
                        Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:806545929748:repository/scan-files/api"
                      - Sid      = ""
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.api.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/api"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # module.api.aws_iam_policy.policies[0] will be created
  + resource "aws_iam_policy" "policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "api-0"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ca-central-1:806545929748:log-group:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # module.api.aws_iam_policy.policies[1] will be created
  + resource "aws_iam_policy" "policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "api-1"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # module.api.aws_iam_policy.policies[2] will be created
  + resource "aws_iam_policy" "policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "api-2"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::scan-files-production-logs"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject*",
                          + "s3:GetObject*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::scan-files-production-logs/waf/*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # module.api.aws_iam_policy.vpc_policies[0] will be created
  + resource "aws_iam_policy" "vpc_policies" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "api_vpc"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForlayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ca-central-1:806545929748:repository/scan-files/api"
                      + Sid      = "ECRImageAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # module.api.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "api"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.api.aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole[0] will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "api"
    }

  # module.api.aws_iam_role_policy_attachment.attachments[0] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "api"
    }

  # module.api.aws_iam_role_policy_attachment.attachments[1] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "api"
    }

  # module.api.aws_iam_role_policy_attachment.attachments[2] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "api"
    }

  # module.api.aws_iam_role_policy_attachment.lambda_insights[0] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_insights" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "api"
    }

  # module.api.aws_iam_role_policy_attachment.vpc_policies[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "api"
    }

  # module.api.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "api"
      + id                             = (known after apply)
      + image_uri                      = "806545929748.dkr.ecr.ca-central-1.amazonaws.com/scan-files/api:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0845d9714e0c52b00",
              + "sg-0df33dfc9ddb1acf5",
            ]
          + subnet_ids         = [
              + "subnet-011bc431a48c5fb24",
              + "subnet-0135ef683aa873b27",
              + "subnet-0cb54bcb064da8ff0",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.api.aws_lambda_permission.api_gateway[0] will be created
  + resource "aws_lambda_permission" "api_gateway" {
      + action        = "lambda:InvokeFunction"
      + function_name = "api"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = "arn:aws:apigateway:ca-central-1::/restapis/zjyu1t6h7e"
      + statement_id  = "AllowAPIGatewayInvoke"
    }

  # module.log_bucket.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined"  {
      ~ id                      = "600896875" -> (known after apply)
      ~ json                    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = [
                                  - "false",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::scan-files-production-logs/*",
                          - "arn:aws:s3:::scan-files-production-logs",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ source_policy_documents = [
          - jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = "s3:*"
                          - Condition = {
                              - Bool = {
                                  - aws:SecureTransport = [
                                      - "false",
                                    ]
                                }
                            }
                          - Effect    = "Deny"
                          - Principal = "*"
                          - Resource  = [
                              - "arn:aws:s3:::scan-files-production-logs/*",
                              - "arn:aws:s3:::scan-files-production-logs",
                            ]
                          - Sid       = "denyInsecureTransport"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ),
        ] -> (known after apply)
      - version                 = "2012-10-17" -> null
    }

  # module.log_bucket.data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deny_insecure_transport"  {
      ~ id      = "600896875" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = [
                                  - "false",
                                ]
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::scan-files-production-logs/*",
                          - "arn:aws:s3:::scan-files-production-logs",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)


            # (2 unchanged blocks hidden)
        }
    }

  # module.log_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "scan-files-production-logs"
      ~ tags                        = {
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.log_bucket.aws_s3_bucket_policy.this will be updated in-place
  ~ resource "aws_s3_bucket_policy" "this" {
        id     = "scan-files-production-logs"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - aws:SecureTransport = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::scan-files-production-logs/*",
                          - "arn:aws:s3:::scan-files-production-logs",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.rds.data.aws_iam_policy_document.read_connection_string will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "read_connection_string"  {
      ~ id      = "3380653621" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "secretsmanager:ListSecretVersionIds",
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                          - "secretsmanager:DescribeSecret",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:ca-central-1:806545929748:secret:scan-files-p2omli-cpSHLz"
                      - Sid      = "0"
                    },
                  - {
                      - Action   = "secretsmanager:ListSecrets"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "1"
                    },
                  - {
                      - Action    = "kms:Decrypt"
                      - Condition = {
                          - StringEquals = {
                              - kms:ViaService = [
                                  - "secretsmanager.ca-central-1.amazonaws.com",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = "2"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.rds.aws_cloudwatch_log_group.proxy will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "proxy" {
        id                = "/aws/rds/proxy/scan-files-proxy"
        name              = "/aws/rds/proxy/scan-files-proxy"
      ~ tags              = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.rds.aws_db_proxy.proxy will be updated in-place
  ~ resource "aws_db_proxy" "proxy" {
        id                     = "scan-files-proxy"
        name                   = "scan-files-proxy"
      ~ tags                   = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rds.aws_db_subnet_group.rds will be updated in-place
  ~ resource "aws_db_subnet_group" "rds" {
        id          = "scan-files-subnet-group"
        name        = "scan-files-subnet-group"
      ~ tags        = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.rds.aws_iam_policy.read_connection_string will be updated in-place
  ~ resource "aws_iam_policy" "read_connection_string" {
        id        = "arn:aws:iam::806545929748:policy/scan-filesReadConnectionString"
        name      = "scan-filesReadConnectionString"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "secretsmanager:ListSecretVersionIds",
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                          - "secretsmanager:DescribeSecret",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:ca-central-1:806545929748:secret:scan-files-p2omli-cpSHLz"
                      - Sid      = "0"
                    },
                  - {
                      - Action   = "secretsmanager:ListSecrets"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "1"
                    },
                  - {
                      - Action    = "kms:Decrypt"
                      - Condition = {
                          - StringEquals = {
                              - kms:ViaService = [
                                  - "secretsmanager.ca-central-1.amazonaws.com",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = "2"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags      = {
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.rds.aws_iam_role.rds_proxy will be updated in-place
  ~ resource "aws_iam_role" "rds_proxy" {
        id                    = "scan-files_rds_proxy"
        name                  = "scan-files_rds_proxy"
      ~ tags                  = {
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rds.aws_rds_cluster.cluster will be updated in-place
  ~ resource "aws_rds_cluster" "cluster" {
        id                                  = "scan-files-cluster"
      ~ tags                                = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (38 unchanged attributes hidden)
    }

  # module.rds.aws_rds_cluster_instance.instances[0] will be updated in-place
  ~ resource "aws_rds_cluster_instance" "instances" {
        id                                    = "scan-files-instance-0"
      ~ tags                                  = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)
    }

  # module.rds.aws_secretsmanager_secret.connection_string will be updated in-place
  ~ resource "aws_secretsmanager_secret" "connection_string" {
        id                             = "arn:aws:secretsmanager:ca-central-1:806545929748:secret:scan-files-p2omli-cpSHLz"
        name                           = "scan-files-p2omli"
      ~ tags                           = {
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.rds.aws_secretsmanager_secret.proxy_connection_string will be updated in-place
  ~ resource "aws_secretsmanager_secret" "proxy_connection_string" {
        id                             = "arn:aws:secretsmanager:ca-central-1:806545929748:secret:scan-files-p2omli-proxy-connection-string-grby2z"
        name                           = "scan-files-p2omli-proxy-connection-string"
      ~ tags                           = {
          + "CostCentre" = "scan-files-production"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.rds.aws_security_group.rds_proxy will be updated in-place
  ~ resource "aws_security_group" "rds_proxy" {
        id                     = "sg-0df33dfc9ddb1acf5"
        name                   = "scan-files_rds_proxy_sg"
      ~ tags                   = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_default_network_acl.default will be updated in-place
  ~ resource "aws_default_network_acl" "default" {
        id                     = "acl-0b9764599a5f16cab"
      ~ tags                   = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_default_route_table.default will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-0a3d3b5124c95c75e"
      ~ tags                   = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_default_security_group.default will be updated in-place
  ~ resource "aws_default_security_group" "default" {
        id                     = "sg-04bdf9bbeb8f7b79d"
        name                   = "default"
      ~ tags                   = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0e18f4d0e163da18b"
      ~ tags                 = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[1] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0da183fd3320c842a"
      ~ tags                 = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[2] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0006f5d2fec670d75"
      ~ tags                 = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.gw will be updated in-place
  ~ resource "aws_internet_gateway" "gw" {
        id       = "igw-08334d6cba7f69191"
      ~ tags     = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.nat_gw[0] will be updated in-place
  ~ resource "aws_nat_gateway" "nat_gw" {
        id                   = "nat-0fd9c6fb797371a94"
      ~ tags                 = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.nat_gw[1] will be updated in-place
  ~ resource "aws_nat_gateway" "nat_gw" {
        id                   = "nat-0c2bd01b29af39d76"
      ~ tags                 = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.nat_gw[2] will be updated in-place
  ~ resource "aws_nat_gateway" "nat_gw" {
        id                   = "nat-045efc03085cee18f"
      ~ tags                 = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_network_acl.main will be updated in-place
  ~ resource "aws_network_acl" "main" {
        id         = "acl-0e28f693339e2a2a0"
      ~ tags       = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-02e47d06de6347730"
      ~ tags             = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-08f266cbde8d20e36"
      ~ tags             = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[2] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-04b39753fdf9d3994"
      ~ tags             = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-00b5fff76c3db4f93"
      ~ tags             = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-0cb54bcb064da8ff0"
      ~ tags                            = {
          + "CostCentre" = "scan-files-production"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-0135ef683aa873b27"
      ~ tags                            = {
          + "CostCentre" = "scan-files-production"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-011bc431a48c5fb24"
      ~ tags                            = {
          + "CostCentre" = "scan-files-production"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-077eae6482ff60f4a"
      ~ tags                            = {
          + "CostCentre" = "scan-files-production"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-03c50d466545a3d1f"
      ~ tags                            = {
          + "CostCentre" = "scan-files-production"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-0b2b97c1001cbc416"
      ~ tags                            = {
          + "CostCentre" = "scan-files-production"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.main will be updated in-place
  ~ resource "aws_vpc" "main" {
        id                               = "vpc-04cc4c1a5a2e97d9a"
      ~ tags                             = {
          + "CostCentre" = "scan-files-production"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)
    }

Plan: 14 to add, 35 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_access"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_waf"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.write_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.waf_log_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.api_waf"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.scan-files"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_waf"]
WARN - plan.json - main - Missing Common Tags: ["module.vpc.aws_cloudwatch_log_group.flow_logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.vpc.aws_flow_log.flow_logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.vpc.aws_iam_policy.vpc_metrics_flow_logs_write_policy[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.vpc.aws_iam_role.flow_logs[0]"]

25 tests, 8 passed, 17 warnings, 0 failures, 0 exceptions

```

</details>
